Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Невозможно удалить объект класса %s из-за наличия на него интерфейсных ссылок: %d
en: Failed to delete the object of %s class due to interface references to it: %d

source: Невозможно преобразовать значение типа Дата/время %g к значению логического типа
en: Failed to convert the Date/time value %g to the boolean value

source: Невозможно преобразовать значение типа Дата/время %g к целому числу
en: Failed to convert the Date/time value %g to integer

source: Невозможно преобразовать значение вещественного типа %g к значению логического типа
en: Failed to convert the real value %g to the boolean value

source: Невозможно преобразовать значение вещественного типа %g к значению типа Дата/время
en: Failed to convert the real value %g to the Date/time value

source: Невозможно преобразовать значение вещественного типа %g к целому числу
en: Failed to convert the real value %g to integer

source: Невозможно преобразовать значение целого типа %d к значению типа Дата/время
en: Failed to convert the integer value %d to the Date/time value

source: Невозможно без потери точности преобразовать значение целого типа %d к вещественному числу
en: Failed to convert the integer value %d to the real number without accuracy loss

source: Невозможно преобразовать число %d размером %d бит к множеству размером %d бит
en: Failed to convert number %d of %d bits to the set of %d bits

source: Невозможно преобразовать множество размером %d бит к числу размером %d-х бит
en: Failed to convert the set of %d bits to the number of %d bits

source: Непосредственный вызов деструктора запрещен
en: Direct call of destructor is forbidden

source: Интерфейс с идентификатором %s не поддерживается объектом
en: Interface with %s identifier not supported by the object

source: Интерфейс %s не поддерживается объектом
en: %s interface not supported by object

source: Объект не является наследником класса %s
en: The object is not a descendant of %s class

source: Невозможно преобразовать строку "%s" к GUID-у
en: Failed to convert "%s" row to GUID

source: Невозможно зарегистрировать более %d процедур финализации для потока
en: Failed to register more than %d procedures of finalization for a stream

source: Пустая ссылка на объект %s
en: Null %s object reference

source: Папка "%s" не может быть скопирована сама в себя
en: "%s" folder cannot be copied into itself

source: Невозможно создать файл: "%s"
en: Failed to create file: "%s"

source: Папка "%s" не может быть перемещена сама в себя
en: "%s" folder cannot be moved into itself

source: Папка "%s" не существует
en: "%s" folder does not exist

source: Ошибка мэппинга файла "%s"
en: "%s" file mapping error

source: Невозможно открыть файл: "%s"
en: Failed to open file: "%s"

source: Файл "%s" не был удалён
en: Failed to delete file "%s"

source: Файл "%s" успешно удалён
en: File "%s" succesfully deleted

source: Директория "%s" не была удалёна
en: Failed to delete directory "%s"

source: Директория "%s" успешно удалена
en: Directory "%s" succesfully deleted

source: Исходный поток данных имеет неправильный Unicode формат
en: Source data stream has invalid Unicode format

source: Попытка чтения за пределами файла
en: Attempted to read outside the file

source: Исходный поток данных не проинициализирован
en: Source data stream not initialized

source: Нельзя изменять параметры пула потоков, после начала его использования
en: Failed to change the thread pool parameters upon start of its applying

source: Внутри задачи нельзя ожидать завершения той же самой задачи
en: Failed to wait for completion of the same task inside the task

source: Одна или несколько подзадач завершились с ошибкой
en: One or several subtasks failed

source: Выполнение задачи невозможно, так как содержащий ее пул потоков удален
en: The task cannot be completed because the thread pool containing it has been deleted

source: Ссылка на объект задачи не проинициализирована
en: Reference to task object not initialized

source: Ошибка при попытке прочитать ключ реестра %s: %s (код ошибки %d)
en: Error attempting to read %s registry key: %s (error code %d)

source: Данная реализация обхода дерева отсутствует
en: This tree walk implementation is missing

source: Невозможно пересоздать индекс имен узлов
en: Failed to re-create node name index

source: Узел
en: Node

source: Корень
en: Root

source: Не удалось найти исходный столбец %s для настраиваемого столбца %s
en: Failed to find source %s column for configurable %s column

source: Не удалось найти исходный узел %s для настраиваемого узла %s
en: Failed to find source %s node for the configurable node %s

source: Назначение "%s" недопустимо для настраиваемой переменной "%s"
en: Usage type "%s" is not valid for the configurable variable "%s"

source: Нельзя редактировать значение настраиваемой переменной, для которой задана исходная переменная
en: Failed to edit the custom variable value for which the source variable is set

source: Не удалось найти исходную переменную %s для настраиваемой переменной %s
en: Failed to find the source variable %s for the configurable variable %s

source: Некорректный формат относительной строковой ссылки
en: Invalid relative string reference format

source: Данные некорректны
en: Invalid data

source: Некорректный формат строковых данных переменной типа Variant
en: Invalid format of Variant variable string data

source: Структуры кортежей несовместимы
en: Tuple structures are incompatible

source: Ошибка XML при разборе схемы, вложенной в WSDL-файл (строка %d, позиция %d): Код ошибки: %d Причина: %s
en: XML error while parsing the schema included into WSDL file (row %d, position %d): Error code: %d Reason: %s

source: Строковые данные Variant-массива некорректны
en: Invalid Variant array string data

source: Данные Variant-массива некорректны
en: Invalid Variant array data

source: Не зарегистрирован менеджер описаний перечислений
en: Enumeration description manager not registered

source: Менеджер переменных для типа %s не зарегистрирован
en: Variable manager for %s type not registered

source: Значение параметра NullAsValue непустого списка уникальных значение изменять запрещено
en: NullAsValue parameter value of a non-empty list of unique values cannot be changed

source: Индекс столбца
en: Column index

source: Добавление пропущенных значений в список уникальных значений запрещено
en: Addition of the null values to the unique values list is forbidden

source: Значение "%s" уже присутствует в списке уникальных значений
en: "%s" value already exists in the list of unique values

source: Данные уникальных значений уже проинициализированы
en: Unique value data has already been initialized

source: Попытка завершить обновление предварительно не начав его
en: Attempting to complete the update process without first starting it

source: Cookie блокируемого объекта принадлежит другому объекту
en: The locked object Cookie belongs to another object

source: Попытка выполнить операцию с пустой ссылкой на Cookie блокируемого объекта
en: Attempt to complete the operation with null reference to the locked object Cookie

source: Попытка разблокировать объект, который не был предварительно заблокирован
en: Attempt to unlock the object that has not been previously locked

source: Cookie обновляемого объекта принадлежит другому объекту
en: The updated object cookie belongs to another object

source: Попытка выполнить операцию с пустой ссылкой на Cookie обновляемого объекта
en: Attempt to complete the operation with null reference to the updated object Cookie

source: Некорректное доменное имя
en: Invalid domain name

source: Имя столбца данных
en: Data column name

source: Переполнение в алгоритме Punycode
en: Overflow in Punycode algorithm

source: Некорректно закодированная с процентами UTF8 последовательность
en: Invalid percent-encoded UTF8 sequence

source: дн.
en: days

source: Строка "%s" не является правильным представлением множества
en: "%s" string is not a valid set representation

source: Переменная с назначением "%s" не найдена
en: Variable with "%s" usage type not found

source: Переменная с именем %s не найдена
en: Variable with %s name not found

source: Ссылка на переменную не задана
en: No reference to variable specified

source: Тип переменной %s не совместим с типом исходной переменной
en: %s variable type is not compatible with the source variable type

source: Столбец входного набора "%s" назначен несуществующему узлу XSD-схемы "%s"
en: "%s" input dataset column has been assigned for nonexistent "%s" XSD schema node

source: Переменные уже находятся в состоянии редактирования
en: Variables already in the editing process

source: Переменные не активны
en: Variables not active

source: Переменные не настроены
en: Variables not configured

source: Переменные не находятся в состоянии редактирования
en: Variables are not in the editable state

source: Переменная "%s" не принадлежит ни одному из используемых списков переменных
en: "%s" variable does not belong to any variable list being used

source: Нельзя связывать переменные "%s" и "%s", принадлежащие одной таблице
en: Failed to link "%s" and "%s" variables from the same table

source: При создании связи должна присутствовать переменная из главной таблицы
en: When creating link, the main table variable must be provided

source: Настройки соответствия входного набора и XSD-схемы ссылаются на несуществующий узел XSD-схемы "%s" и столбец входного набора "%s"
en: The mapping settings of the input dataset and XSD schema refer to nonexistent "%s" node of XSD schema and "%s" column of the input set

source: Переменная "%s" таблицы %d может входить только в "одну" связь
en: "%s" variable of table %d can only be part of a "single" link

source: Ошибка преобразования строки "%s" к значению типа %s
en: Error converting "%s" string to %s value

source: Недопустимые значения параметров при преобразовании вектора Variant-ов к открытому массиву: Length(Result) = %d; Length(Value) = %d; Count = %d; Offset = %d
en: Invalid parameter values when converting the Variant vector to the open array: Length(Result) = %d; Length(Value) = %d; Count = %d; Offset = %d

source: Невозможно добавить %s с меткой "%s" и идентификатором %s: в списке уже существует элемент с данным идентификатором
en: Failed to add %s with caption "%s" and identifier %s: An element with this identifier is already on the list.

source: группа поставщиков информации
en: vendor group

source: поставщик информации
en: vendor

source: Столбец входного набора "%s" имеет тип данных "%s", который нельзя преобразовать к типу "%s" узла XSD-схемы "%s"
en: "%s" column of the input dataset has "%s" data type that cannot be converted to "%s" type of "%s" node of XSD schema

source: Не удалось открыть, архив поврежден или имеет неизвестный формат
en: Failed to open. The archive is damaged

source: Архив открыт только на чтение
en: This archive is read-only

source: Архив не открыт
en: Archive not open

source: Ошибка сжатия данных
en: Data compression error

source: Ошибка сжатого потока данных
en: Compressed data stream error

source: Нельзя создать поток чтения пока не закончен поток записи
en: Failed to create a read stream until the write stream is finished

source: Не удалось создать поток для записи
en: Failed to create the write stream

source: Не удалось обновить заголовки файлов
en: Failed to update file headers

source: Не удалось найти директории в архиве
en: Failed to find directories in archive

source: Файл %s уже существует в архиве
en: %s file already exists in the archive

source: Узлу XSD-схемы "%s" назначен несуществующий столбец входного набора "%s"
en: "%s" node of XSD schema has been assigned for nonexistent "%s" input dataset column

source: Файл с именем %s уже есть в архиве
en: File with %s name already exists in the archive

source: Индекс за пределами диапазона
en: Out of range index

source: Добавление в архив нескольких файлов параллельно не поддерживается
en: Adding several files to the archive in parallel is not supported

source: Ошибка при обновлении локального заголовка файла
en: Error updating local file header

source: Перемещаться по потоку данных можно только вперёд
en: It is possible to move only forward in the data stream

source: Невозможно переместится по потоку данных
en: Failed to move along the data stream

source: Поток уже закончен
en: Stream already completed

source: Ошибка шифрования данных
en: Data encryption error

source: Неверный пароль
en: Wrong password

source: Не удалось установить свойство "%s"
en: Failed to set "%s" property

source: Для узла схемы %s с обязательным значением не назначена связь с полем входного набора
en: For %s schema node with required value, no association with the input dataset field has been assigned

source: Ошибка при удалении среды выполнения JavaScript
en: Error while disposing JavaScript runtime environment

source: Ошибка при обработке неперехваченных ошибок Promise
en: Error while processing uncaught Promise errors

source: Операция не поддерживается. Используется несовместимая версия библиотеки ChakraCore.
en: Operation is not supported. Incompatible version of ChakraCore library is used.

source: Не обработанное исключение при постановке в очередь событий JavaScript
en: Unhandled exception when queuing JavaScript events

source: Не обработанное исключение внутри встроенной функции JavaScript: "%s"
en: Unhandled exception inside JavaScript built-in function: "%s"

source: Не обработанное исключение при загрузке модуля JavaScript
en: Unhandled exception when loading JavaScript module

source: Не обработанная ошибка Promise
en: Unhandled Promise error

source: Не обработанные ошибки Promise
en: Unhandled Promise errors

source: У узла схемы %s должен быть выбран для экспорта хотя бы один подузел
en: %s schema node must have at least one subnode selected for export

source: Не обработанное исключение при отслеживании отклоненных Promise
en: Unhandled exception when tracking rejected Promise

source: Некорректно сериализован служебный JavaScript-код в ресурсе %s, выполняется несериализованный код
en: Service JavaScript code in %s resource incorrectly serialized, non-serialized code executed

source: Не удалось выполнить служебный JavaScript-код (источник: %s)
en: Failed to execute service JavaScript-code (source: %s)

source: Не найдена библиотека %s ^%d.%d
en: %s ^%d.%d library not found

source: Преобразование переданного объекта JavaScript в значение переменного типа не поддерживается
en: Transformation of the passed JavaScript object into the variant type value is not supported

source: Атрибут %s не существует.
en: %s attribute does not exist.

source: Элемент конфигурации не принадлежит указанному списку
en: The configuration element does not belong to the specified list

source: Элемент конфигурации с именем %s не найден
en: Configuration element with %s name not found

source: Ссылка на коллекцию не проинициализирована или неверного класса
en: Collection reference has not been initialized or relates to an invalid class

source: Невозможно экспортировать значение %d в узел XML-документа с типом "%s": %s
en: Failed to export value %d to XML document node with "%s" type: %s

source: Обращение к значению атрибута %s типа %s как к значению типа %s
en: Error occurred while accessing %s attribute value of %s type as the value of %s type

source: Длина %d массива превышает допустимую границу %d
en: Length of array %d exceeds the allowable %d limit

source: Неверный класс списка узлов конфигурации
en: Invalid configuration node list class

source: Добавлена заметка
en: Annotation Added

source: Добавлено подключение "%s"
en: "%s" Connection Added

source: Добавлено подключение
en: Connection Added

source: Добавлена связь "%s.%s" - "%s.%s"
en: "%s.%s" - "%s.%s" Link Added

source: Добавлена связь
en: Link Added

source: Добавлен узел "%s"
en: "%s" Node Added

source: Добавлен узел
en: Node Added

source: Попытка создать контекст экспорта XML без указания источника данных
en: Attempt to create XML export context not specifying data source

source: Добавлен компонент "%s"
en: "%s" Component Added

source: Добавлен компонент
en: Component Added

source: Добавлен визуализатор "%s"
en: "%s" Visualizer Added

source: Добавлен визуализатор
en: Visualizer Added

source: Узлы объединены в подмодель "%s"
en: Nodes Composed in "%s" Supernode

source: Узлы объединены в подмодель
en: Nodes Composed in Supernode

source: Настроен узел "%s"
en: Configured "%s" Node

source: Настроен узел
en: Node Configured

source: Настроен порт "%s" узла "%s"
en: Configured "%s" port of "%s" node

source: Настроен порт узла
en: Node Port Configured

source: Невозможно повторно добавить атрибут %s к корневому элементу XML-документа %s
en: Failed to re-add %s attribute to %s XML document root element

source: Имя или описание столбца
en: Column name or definition

source: Удалена заметка
en: Annotation Deleted

source: Удалено подключение "%s"
en: Delete "%s" connection

source: Удалено подключение
en: Delete Connection

source: Удалена связь "%s.%s" - "%s.%s"
en: "%s.%s" - "%s.%s" Link Deleted

source: Удалена связь
en: Delete Link

source: Удален узел "%s"
en: "%s" Node Deleted

source: Удален узел
en: Node Deleted

source: Удален компонент "%s"
en: "%s" Component Deleted

source: Удален компонент
en: Component Deleted

source: Удален визуализатор "%s"
en: "%s" Visualizer Deleted

source: Невозможно повторно добавить элемент %s к корневому элементу XML-документа %s
en: Failed to re-add %s element to root element of %s XML document

source: Удален визуализатор
en: Visualizer Deleted

source: Связь не задана
en: No link set

source: Не удалось восстановить узел "%s"
en: Failed to restore "%s" node

source: Пакет, которому принадлежал объект, был закрыт
en: The package to which the object belonged was closed

source: Узел "%s" заблокирован
en: "%s" node is locked

source: Узел не задан
en: No node specified

source: Подмодель "%s" развернута
en: Expanded "%s" supernode

source: Подмодель развернута
en: Expanded supernode

source: Перемещена связь "%s.%s" - "%s.%s"
en: "%s.%s" - "%s.%s" Link Moved

source: Перемещена связь
en: Link Moved

source: XSD-схема не позволяет экспортировать элемент %s в текущий XML-документ
en: XSD schema does not allow exporting %s element to current XML document

source: Установлены переменные пакета "%s"
en: "%s" Package Variables Set

source: Установлены переменные пакета
en: Package Variables Set

source: Не зарегистрирован класс для идентификатора "%s"
en: Class not registered for "%s" identifier

source: Попытка удаления текущей точки восстановления: "%s"
en: Attempt to delete the current backup point: "%s"

source: Нельзя вернуть изменения до точки: "%s"
en: Rollback to backup point "%s" failed

source: Ошибка инициализации точки восстановления: "%s"
en: Backup point initialization error: "%s"

source: Не удалось восстановить точку: "%s"
en: Failed to restore point: "%s"

source: Не удалось обновить точку: "%s"
en: Failed to update point: "%s"

source: Путь узла дерева
en: Tree node path

source: В процессе восстановления возникли ошибки
en: Errors occurred during recovery

source: Попытка выполнить закрытие корневой точки восстановления
en: Attempt to close root recovery point

source: Несоответствие типа данных атрибута "%s"
en: "%s" attribute data type mismatch

source: Ошибка чтения целого упакованного числа
en: Error reading packed integer number

source: Неподдерживаемый поток данных конфигурации
en: Unsupported configuration data stream

source: Неподдерживаемая версия %d потока данных конфигурации
en: Unsupported version of configuration data stream %d

source: Ошибка загрузки файла конфигурации: %s
en: Configuration file loading error: %s

source: Ошибка сохранения файла конфигурации: %s
en: Configuration file saving error: %s

source: Атрибут схемы с именем "%s" не найден.
en: Schema attribute with "%s" name not found.

source: Тип схемы "%s" содержит более одного атрибута с именем "%s"
en: Type of "%s" schema contains more than one attribute with "%s" name

source: Элемент %s из пространства имен %s не может содержать секцию <CDATA/>, т.к. имеет тип '%s'
en: %s element from %s namespace cannot contain <CDATA/> section because it is of '%s' type

source: Элемент схемы с именем "%s" не найден.
en: Schema element with "%s" name was not found.

source: Элемент перечисления с именем "%s" не найден.
en: Enumeration item with "%s" name was not found.

source: Тип схемы "%s" содержит атрибут и элемент с одинаковым именем "%s"
en: Type of "%s" schema contains attribute and element with the same "%s" name

source: Тип с именем "%s" не найден.
en: Type with "%s" name not found.

source: Тип схемы %s загружаемой конфигурации не совместим с типом схемы %s объекта
en: Type of %s schema of the loaded configuration is not compatible with the schema type of %s object

source: Отсутствует базовый элемент для производного элемента коллекции с идентификатором %s
en: No base element for the derived collection element with %s identifier

source: Отсутствует базовый элемент для производного элемента коллекции с идентификатором %d
en: No base element for the derived collection element with identifier %d

source: Отсутствует базовый элемент для производного элемента коллекции с именем %s
en: No base element for the derived collection element with %s name

source: Отсутствует базовый элемент для производного элемента коллекции
en: No base element for the derived collection element

source: Превышение максимального количества появлений элемента "%s" (разрешено %d)
en: Maximum number of "%s" element occurrences exceeded (%d allowed)

source: В коллекции содержится более одного элемента, отнаследованного от элемента с идентификатором %s
en: The collection contains more than one item derived from the item with %s identifier

source: В коллекции содержится более одного элемента, отнаследованного от элемента с идентификатором %d
en: The collection contains more than one item derived from the item with identifier %d

source: В коллекции содержится более одного элемента, отнаследованного от элемента с именем %s
en: The collection contains more than one item derived from the item with %s name

source: В коллекции содержались базовый и производный элементы с одинаковым уникальным идентификатором %s. Базовый элемент проигнорирован
en: The collection contained base and derived items with the same unique identifier %s. The base item was ignored

source: В коллекции содержится более одного элемента с идентификатором %s
en: The collection contains more than one item with %s identifier

source: В коллекции содержались базовый и производный элементы с одинаковым идентификатором %d. Идентификатор производного элемента изменен на %d
en: The collection contained base and derived items with the same identifier %d. The derived item identifier was changed to %d

source: В коллекции содержались базовый и производный элементы с одинаковым идентификатором %d. Базовый элемент проигнорирован
en: The collection contained base and derived items with the same identifier %d. The base item was ignored

source: В коллекции содержится более одного элемента с идентификатором %d
en: The collection contains more than one item with identifier %d

source: В коллекции содержались базовый и производный элементы с одинаковым именем %s. Производный элемент переименован в %s
en: The collection contained base and derived items with the same %s name. The derived item was renamed to %s

source: У элемента "%s" отсутствует родительский элемент
en: No parent element in "%s" element

source: В коллекции содержались базовый и производный элементы с одинаковым именем %s. Базовый элемент проигнорирован
en: The collection contained base and derived items with the same %s name. The base item was ignored
